Table of Contents
 Class LineLoad
Namespace
IdeaRS.OpenModel.Detail.Loading
Assembly
IdeaRS.OpenModel.dll
Line load
public class LineLoad : LoadBase
Inheritance
object
OpenObject
LoadBase
LineLoad
Inherited Members
 LoadBase.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LineLoad()
constructor
public LineLoad()
Properties
 Angle
angle of load
public double Angle { get; set; }
Property Value
double
 BegFx
force in X at biginning
public double BegFx { get; set; }
Property Value
double
 BegFy
force in Y at beginning
public double BegFy { get; set; }
Property Value
double
 BegPositionX
point support position X
public double BegPositionX { get; set; }
Property Value
double
 BegPositionY
point support position Y
public double BegPositionY { get; set; }
Property Value
double
 Direction
local / global
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 DirectionType
direction type of load
public DirectionType DirectionType { get; set; }
Property Value
DirectionType
 EdgePositionType
edge position type
public EdgeOrientationType EdgePositionType { get; set; }
Property Value
EdgeOrientationType
 EndFx
force in X at end
public double EndFx { get; set; }
Property Value
double
 EndFy
force in Y at end
public double EndFy { get; set; }
Property Value
double
 EndPositionX
point support position X
public double EndPositionX { get; set; }
Property Value
double
 EndPositionY
point support position Y
public double EndPositionY { get; set; }
Property Value
double
 GeneralLine
general shape
public PolyLine2D GeneralLine { get; set; }
Property Value
PolyLine2D
 GeometryPointsPath
list of line load points
public Polygon2D GeometryPointsPath { get; set; }
Property Value
Polygon2D
 LengthOnEdge
length of load
public double LengthOnEdge { get; set; }
Property Value
double
 MasterComponent
Gets or sets the master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdge
master component edge
public int MasterEdge { get; set; }
Property Value
int
 MasterPoint
master point
public int MasterPoint { get; set; }
Property Value
int
 Name
Gets or set the name
public string Name { get; set; }
Property Value
string
 PositionOnEdge
position od edge
public double PositionOnEdge { get; set; }
Property Value
double
 ResultantForces
forces value
public string ResultantForces { get; set; }
Property Value
string
 TypeEdgePosition
edge position type
public TypeEdgePosition TypeEdgePosition { get; set; }
Property Value
TypeEdgePosition
 TypeLinePosition
type of position
public TypeLinePosition TypeLinePosition { get; set; }
Property Value
TypeLinePosition
 Edit this page